/*---------------------------------------------------------------------*/
/* --- STC MCU International Limited ----------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.GXWMCU.com --------------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了宏晶科技的资料及程序   */
/*---------------------------------------------------------------------*/


/*************	本程序功能说明	**************

低压时， 查询到低压信号送一个IO口指示。

用户下载时, 要禁止低压复位, 并且选一个合适的低压检测电压和一个合适的CPU-CORE最高电压, 

并且低压检测电压要比CPU-CORE最高电压高. 本例程分别选择3.70V和2.74V.

!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
注意：下载时，下载界面"硬件选项"中下面的项要固定如下设置:

不勾选	允许低压复位(禁止低压中断)

		低压检测电压 3.70V
		
		选择CPU-CORE最高电压  2.74V

!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!


******************************************/

#include	<reg51.h>


sbit	P_Indicator = P1^0;	//低压指示, 低压时输出低电平, 电压正常时输出高电平.


/********************** 主函数 ************************/
void main(void)
{

	PCON &= ~(1<<5);		//低压检测标志清0, 上电时标志为1

	while(1)
	{
		if(PCON & (1<<5))	P_Indicator = 0;	//检测到低电压
		else				P_Indicator = 1;	//电压正常
		
		PCON &= ~(1<<5);		//低压检测标志清0
	}
} 
/**********************************************/


