
;---------------------------------------------------------------------
; --- STC MCU Limited ------------------------------------------------
; --- Mobile: (86)13922805190 ----------------------------------------
; --- Fax: 86-755-82905966 -------------------------------------------
; --- Tel: 86-755-82948412 -------------------------------------------
; --- Web: www.STCMCU.com --------------------------------------------
; 如果要在文章中应用此代码,请在文章中注明使用了宏晶科技的资料及程序   
;---------------------------------------------------------------------


;/*************	本程序功能说明	**************

;低压时， 查询到低压信号送一个IO口指示。

;用户下载时, 要禁止低压复位, 并且选一个合适的低压检测电压和一个合适的CPU-CORE最高电压, 

;并且低压检测电压要比CPU-CORE最高电压高. 本例程分别选择3.70V和2.74V.

;!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
;注意：下载时，下载界面"硬件选项"中下面的项要固定如下设置:

;不勾选	允许低压复位(禁止低压中断)

;		低压检测电压 3.70V
		
;		选择CPU-CORE最高电压  2.74V

;!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!


;******************************************/


P_Indicator BIT 	P1.0	; 低压指示, 低压时输出低电平, 电压正常时输出高电平.


;*******************************************************************
;*******************************************************************
	ORG		00H				;reset
	LJMP	F_Main

F_main:

	ANL		PCON, #NOT (1 SHL 5)	; 低压检测标志清0, 上电时标志为1
L_MainLoop:
	MOV		A, PCON
	MOV		C, ACC.5
	CPL		C
	MOV		P_Indicator, C			; 把LVD信号取反后送给P_Indicator指示, 低电压输出0, 电压正常输出1
	ANL		PCON, #NOT (1 SHL 5)	; 低压检测标志清0

	LJMP	L_MainLoop
;========================================================

	END
	

