/**************************************************************************************
深圳市普中科技有限公司（PRECHIN 普中）
技术支持：www.prechin.net
PRECHIN
 普中
 
实验名称：LCD9648液晶显示实验
接线说明：	
实验现象：下载程序后，LCD9648上显示字符汉字信息
注意事项：																				  
***************************************************************************************/
#include "public.h"
#include "lcd9648.h"


/*******************************************************************************
* 函 数 名       : main
* 函数功能		 : 主函数
* 输    入       : 无
* 输    出    	 : 无
*******************************************************************************/
void main()
{	
	lcd9648_init();
	lcd9648_clear();
	lcd_show_string(0,0,LCD_WIDTH,LCD_HEIGHT,12,"Hello World!");
	lcd_show_string(0,14,LCD_WIDTH,LCD_HEIGHT,12,"0123456789");
	lcd_show_fontHZ(0, 30,"普中科技");
	lcd_reflash_gram();
	while(1)
	{
		
			
	}	
}
