
/*------------------------------------------------------------------*/
/* --- STC MCU International Limited -------------------------------*/
/* --- STC 1T Series MCU RC Demo -----------------------------------*/
/* --- Mobile: (86)13922805190 -------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ---------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ---------------------*/
/* --- Web: www.GXWMCU.com -----------------------------------------*/
/* --- QQ:  800003751 ----------------------------------------------*/
/* If you want to use the program or the program referenced in the  */
/* article, please specify in which data and procedures from STC    */
/*------------------------------------------------------------------*/


#ifndef		__CONFIG_H
#define		__CONFIG_H


/*********************************************************/

//#define MAIN_Fosc		32000000UL	//定义主时钟
#define MAIN_Fosc		22118400UL	//定义主时钟
//#define MAIN_Fosc		16000000UL	//定义主时钟
//#define MAIN_Fosc		12000000UL	//定义主时钟
//#define MAIN_Fosc		11059200UL	//定义主时钟
//#define MAIN_Fosc		 5529600UL	//定义主时钟
//#define MAIN_Fosc		24000000UL	//定义主时钟


/*********************************************************/

#include	"STC15Fxxxx.H"



#endif
